#+TITLE: Rパッケージ開発入門
#+STARTUP: overview
**** コードを作る
#+BEGIN_SRC sh
echo 'greet <- function(name) {print(paste0("hello, ", name, "!"))}' > mytestpkg/R/hello.R
cat mytestpkg/R/hello.R
#+END_SRC

#+RESULTS:
| greet <- function(name) {print(paste0("hello | , name, !"))} |
*** 依存関係: バッケージには何が必要か
#+BEGIN_SRC R
  devtools::use_package("beepr", "imports", "mytestpkg")
#+END_SRC

#+RESULTS:
devtools::use_package()とすると，自動的に Imports を DESCRIPTION に追加できる．
Suggests を追加したければ
devtools::use_package("package", "Suggests")．
**** 最初の1回
#+BEGIN_SRC R :results output
  devtools::use_vignette("my-vignette", "mytestpkg")
#+END_SRC

#+RESULTS:
上のコードを実行することによって，以下が自動で実行される．
- vignettes/ ディレクトリを作成する
- DESCRIPTION に必要な依存関係を追記する（Suggests と VignetteBuilder フィールドに knitr を追記する）
- vignette の草稿版である vignettes/my-vignette.Rmd を作成する

**** 普通のやり方
#+BEGIN_SRC R
devtools::build("./mytestpkg")
#+END_SRC

#+RESULTS:
: /Users/ahayashi/Documents/GitHub/study/R/mytestpkg_0.0.0.9000.tar.gz
*** 検索パス
アタッチしている全てのパッケージのリスト．
#+BEGIN_SRC R
search()
#+END_SRC

#+RESULTS:
| .GlobalEnv        |
| package:stats     |
| package:graphics  |
| package:grDevices |
| package:utils     |
| package:datasets  |
| package:formatR   |
| package:beepr     |
| MacJapanEnv       |
| package:methods   |
| Autoloads         |
| package:base      |

